Catalogs/упВидыАдресов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упВидыАдресов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВремяПрохожденияТочки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьКакБазовыйАдресОтправления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриоритетноеПостроениеМассиваРасстояний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильВершиныГрафа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиМаркеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильВыбранногоМаркера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиМаркеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильВыделенногоМаркера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиМаркеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильМаркера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиМаркеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РежимыПеревалки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВходящийТипПеревозки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упТипыПеревозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходящийТипПеревозки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упТипыПеревозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/упКартинкиМаркеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упКартинкиМаркеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыбратьИзФайла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПоУмолчанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерГолубой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЖелтый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЗеленый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерКрасный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерСиний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерФиолетовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойБелый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойГолубой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЖелтый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЗеленый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойКрасный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойОранжевый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойРозовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСерый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСиний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойФиолетовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЧерный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПоУмолчаниюВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерГолубойВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЖелтыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЗеленыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерКрасныйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерСинийВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерФиолетовыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойБелыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойГолубойВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЖелтыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЗеленыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойКрасныйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойОранжевыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойРозовыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСерыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСинийВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойФиолетовыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЧерныйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПоУмолчаниюВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерГолубойВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЖелтыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЗеленыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерКрасныйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерСинийВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерФиолетовыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойБелыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойГолубойВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЖелтыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЗеленыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойКрасныйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойОранжевыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойРозовыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСерыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСинийВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойФиолетовыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЧерныйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПрибытиеВТочкуМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерНачалоРаботВТочкеМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерУбытиеСТочкиМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерСообщениеДиспетчеру</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерСообщениеОтДиспетчера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерИсходящийЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерВходящийЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерТочкаПропущена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортноеСредство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобытиеМониторинга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерИзменениеСледующейТочкиПоМаршруту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерОтсутствиеЛицензииНаПодключение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КроссДокинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Магазин</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Склад</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упВидыАдресов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если упСервисныеФункции.ЭтоВызовПослеОткрытияФормы(ЭтаФорма) Тогда
		ПриСозданииПриЧтенииНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	мсвСтилей = Новый Массив;
	Если ЗначениеЗаполнено(Объект.СтильМаркера) Тогда
		мсвСтилей.Добавить(Объект.СтильМаркера);
	КонецЕсли;	
	Если ЗначениеЗаполнено(Объект.СтильВыделенногоМаркера) Тогда
		мсвСтилей.Добавить(Объект.СтильВыделенногоМаркера);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.СтильВыбранногоМаркера) Тогда
		мсвСтилей.Добавить(Объект.СтильВыбранногоМаркера);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.СтильВершиныГрафа) Тогда
		мсвСтилей.Добавить(Объект.СтильВершиныГрафа);
	КонецЕсли;
	
	Если мсвСтилей.Количество() Тогда
		соотКартинки = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(мсвСтилей, "ХранилищеЗначения, Картинка");
		Для каждого текЗначение Из соотКартинки Цикл
			сткРеквизитов = текЗначение.Значение;
			Если текЗначение.Ключ = Объект.СтильМаркера Тогда
				Если сткРеквизитов.Картинка = Перечисления.упКартинкиМаркеров.ВыбратьИзФайла Тогда
					КартинкаМаркераИзХранилища = ПоместитьВоВременноеХранилище(сткРеквизитов.ХранилищеЗначения.Получить(), УникальныйИдентификатор);
					Элементы.СтраницыМаркера.ТекущаяСтраница  = Элементы.СтраницаМаркераИзХранилища;
				Иначе
					КартинкаМаркера = упРаботаСКартамиКлиентСервер.ПолучитьКартинку(сткРеквизитов.Картинка);
					Элементы.СтраницыМаркера.ТекущаяСтраница  = Элементы.СтраницаМаркераКартинка;
				КонецЕсли;
			КонецЕсли;
			Если текЗначение.Ключ = Объект.СтильВыделенногоМаркера Тогда
				Если сткРеквизитов.Картинка = Перечисления.упКартинкиМаркеров.ВыбратьИзФайла Тогда
					КартинкаВыделенногоМаркераИзХранилища = ПоместитьВоВременноеХранилище(сткРеквизитов.ХранилищеЗначения.Получить(), УникальныйИдентификатор);
					Элементы.СтраницыВыделенногоМаркера.ТекущаяСтраница  = Элементы.СтраницаВыделенногоМаркераИзХранилища;
				Иначе
					КартинкаВыделенногоМаркера = упРаботаСКартамиКлиентСервер.ПолучитьКартинку(сткРеквизитов.Картинка);
					Элементы.СтраницыВыделенногоМаркера.ТекущаяСтраница  = Элементы.СтраницаВыделенногоМаркераКартинка;
				КонецЕсли;		
			КонецЕсли;
			Если текЗначение.Ключ = Объект.СтильВыбранногоМаркера Тогда
				Если сткРеквизитов.Картинка = Перечисления.упКартинкиМаркеров.ВыбратьИзФайла Тогда
					КартинкаВыбранногоМаркераИзХранилища = ПоместитьВоВременноеХранилище(сткРеквизитов.ХранилищеЗначения.Получить(), УникальныйИдентификатор);
					Элементы.СтраницыВыбранногоМаркера.ТекущаяСтраница  = Элементы.СтраницаВыбранногоМаркераИзХранилища;
				Иначе
					КартинкаВыбранногоМаркера = упРаботаСКартамиКлиентСервер.ПолучитьКартинку(сткРеквизитов.Картинка);
					Элементы.СтраницыВыбранногоМаркера.ТекущаяСтраница  = Элементы.СтраницаВыбранногоМаркераКартинка;
				КонецЕсли;	
			КонецЕсли;
			Если текЗначение.Ключ = Объект.СтильВершиныГрафа Тогда
				Если сткРеквизитов.Картинка = Перечисления.упКартинкиМаркеров.ВыбратьИзФайла Тогда
					КартинкаВершиныГрафаИзХранилища = ПоместитьВоВременноеХранилище(сткРеквизитов.ХранилищеЗначения.Получить(), УникальныйИдентификатор);
					Элементы.СтраницыВершиныГрафа.ТекущаяСтраница  = Элементы.СтраницаВершиныГрафаИзХранилища;
				Иначе
					КартинкаВершиныГрафа = упРаботаСКартамиКлиентСервер.ПолучитьКартинку(сткРеквизитов.Картинка);
					Элементы.СтраницыВершиныГрафа.ТекущаяСтраница  = Элементы.СтраницаВершиныГрафаКартинка;
				КонецЕсли;	
			КонецЕсли;
			
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПриСозданииПриЧтенииНаСервере();
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СтильМаркераПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СтильМаркера) Тогда
		сткРеквизитов = ПолучитьЗначенияРеквизитовНаСервере(Объект.СтильМаркера);
		Если сткРеквизитов.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.ВыбратьИзФайла") Тогда
			КартинкаМаркераИзХранилища = ПоместитьВоВременноеХранилище(сткРеквизитов.ХранилищеЗначения, УникальныйИдентификатор);
			Элементы.СтраницыМаркера.ТекущаяСтраница  = Элементы.СтраницаМаркераИзХранилища;
		Иначе
			КартинкаМаркера = упРаботаСКартамиКлиентСервер.ПолучитьКартинку(сткРеквизитов.Картинка);
			Элементы.СтраницыМаркера.ТекущаяСтраница  = Элементы.СтраницаМаркераКартинка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтильВыделенногоМаркераПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СтильВыделенногоМаркера) Тогда
		сткРеквизитов = ПолучитьЗначенияРеквизитовНаСервере(Объект.СтильВыделенногоМаркера);
		Если сткРеквизитов.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.ВыбратьИзФайла") Тогда
			КартинкаВыделенногоМаркераИзХранилища = ПоместитьВоВременноеХранилище(сткРеквизитов.ХранилищеЗначения, УникальныйИдентификатор);
			Элементы.СтраницыВыделенногоМаркера.ТекущаяСтраница  = Элементы.СтраницаВыделенногоМаркераИзХранилища;
		Иначе
			КартинкаВыделенногоМаркера = упРаботаСКартамиКлиентСервер.ПолучитьКартинку(сткРеквизитов.Картинка);
			Элементы.СтраницыВыделенногоМаркера.ТекущаяСтраница  = Элементы.СтраницаВыделенногоМаркераКартинка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтильВыбранногоМаркераПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СтильВыбранногоМаркера) Тогда
		сткРеквизитов = ПолучитьЗначенияРеквизитовНаСервере(Объект.СтильВыбранногоМаркера);
		Если сткРеквизитов.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.ВыбратьИзФайла") Тогда
			КартинкаВыбранногоМаркераИзХранилища = ПоместитьВоВременноеХранилище(сткРеквизитов.ХранилищеЗначения, УникальныйИдентификатор);
			Элементы.СтраницыВыбранногоМаркера.ТекущаяСтраница  = Элементы.СтраницаВыбранногоМаркераИзХранилища;
		Иначе
			КартинкаВыбранногоМаркера = упРаботаСКартамиКлиентСервер.ПолучитьКартинку(сткРеквизитов.Картинка);
			Элементы.СтраницыВыбранногоМаркера.ТекущаяСтраница  = Элементы.СтраницаВыбранногоМаркераКартинка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтильВершиныГрафаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СтильВершиныГрафа) Тогда
		сткРеквизитов = ПолучитьЗначенияРеквизитовНаСервере(Объект.СтильВершиныГрафа);
		Если сткРеквизитов.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.ВыбратьИзФайла") Тогда
			КартинкаВершиныГрафаИзХранилища = ПоместитьВоВременноеХранилище(сткРеквизитов.ХранилищеЗначения, УникальныйИдентификатор);
			Элементы.СтраницыВершиныГрафа.ТекущаяСтраница  = Элементы.СтраницаВершиныГрафаИзХранилища;
		Иначе
			КартинкаВершиныГрафа = упРаботаСКартамиКлиентСервер.ПолучитьКартинку(сткРеквизитов.Картинка);
			Элементы.СтраницыВершиныГрафа.ТекущаяСтраница  = Элементы.СтраницаВершиныГрафаКартинка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

// Нет.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначенияРеквизитовНаСервере(СтильМаркера)
	
	сткРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтильМаркера, "ХранилищеЗначения, Картинка");
	сткРеквизитов.ХранилищеЗначения = сткРеквизитов.ХранилищеЗначения.Получить();
	
	Возврат сткРеквизитов;
	
КонецФункции // ПолучитьЗначенияРеквизитовНаСервере()

#КонецОбласти
